# RemoveConnectorLinkWarn Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..ConnectorFailures..::..RemoveConnectorLinkWarn Property
BuiltInFailures..::..ConnectorFailures Class See Also
---
The link between connector [Index] and connector [Index] is removed.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId RemoveConnectorLinkWarn { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RemoveConnectorLinkWarn As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ RemoveConnectorLinkWarn {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..ConnectorFailures Class
Autodesk.Revit.DB Namespace